# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-cls image classification model with YOLO backbone
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 1000 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, KernelWarehouse, [64, 128, 3, 1, 1]]  # Replace Conv2D with KernelWarehouse
  - [-1, 1, CBAM, [128]]                          # Add CBAM after KernelWarehouse

# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]] # Classify
